1
3
10
600
576
4
3
10
584
576
4
3
29
238
685
589
576
582
576
588
576
12
17
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
602
576
4
3
10
663
576
4
3
10
659
576
4
3
29
238
685
589
576
582
576
588
576
12
17
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
660
576
4
3
10
658
576
4
3
10
662
576
4
3
10
600
576
4
3
10
598
576
4
3
29
235
685
589
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
582
576
12
16
4
3
10
589
576
4
3
29
231
685
589
576
12
4
3
10
589
576
4
3
10
580
576
4
3
10
582
576
4
3
10
600
576
4
3
29
230
685
589
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
581
576
4
3
10
588
576
4
3
29
230
685
589
576
581
576
581
576
581
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
594
576
4
3
10
581
576
4
3
10
581
576
4
3
10
610
576
4
3
10
610
576
4
3
10
581
576
4
3
10
581
576
4
3
10
588
576
4
3
10
580
576
4
3
10
600
576
4
3
29
230
685
589
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
581
576
4
3
10
588
576
4
3
29
235
685
589
576
582
576
588
576
12
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
600
576
4
3
29
235
685
589
576
582
576
588
576
12
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
588
576
4
3
10
600
576
4
3
10
602
576
4
3
10
661
576
4
3
10
633
576
4
3
10
578
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
595
576
4
3
10
596
576
4
3
10
600
576
4
3
10
606
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
595
576
4
3
10
596
576
4
3
10
600
576
4
3
10
606
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
601
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
595
576
4
3
10
596
576
4
3
10
600
576
4
3
10
606
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
31
235
685
613
576
620
576
605
576
14
16
4
3
10
613
576
4
3
29
235
0
685
619
576
253
619
452
576
13
4
3
10
619
576
4
3
10
585
576
4
3
10
620
576
4
3
10
578
576
4
3
10
601
576
4
3
10
595
576
4
3
10
596
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
600
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
606
576
4
3
10
611
576
4
3
10
595
576
4
3
10
626
576
4
3
10
605
576
4
3
10
596
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
600
576
4
3
10
580
576
4
3
10
580
576
4
3
10
601
576
4
3
10
595
576
4
3
10
596
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
685
616
576
20
4
3
10
618
576
4
3
10
580
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
602
576
4
3
10
600
576
4
3
10
580
576
4
3
10
580
576
4
3
10
594
576
4
3
10
626
576
4
3
10
588
576
4
3
10
594
576
4
3
10
626
576
4
3
10
588
576
4
3
29
232
685
589
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
579
576
21
4
3
10
589
576
4
3
10
597
576
4
3
10
579
576
4
3
10
579
576
4
3
10
595
576
4
3
10
596
576
4
3
10
602
576
4
3
29
235
589
576
582
576
588
576
12
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
606
576
4
3
10
611
576
4
3
10
606
576
4
3
10
611
576
4
3
29
230
589
576
581
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
594
576
4
3
10
581
576
4
3
10
581
576
4
3
10
588
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
616
576
20
4
3
10
618
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
611
576
4
3
10
600
576
4
3
10
582
576
4
3
10
602
576
4
3
10
595
576
4
3
10
596
576
4
3
10
600
576
4
3
10
601
576
4
3
10
606
576
4
3
10
600
576
4
3
10
600
576
4
3
10
585
576
4
3
10
584
576
4
3
10
582
576
4
3
10
579
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
30
616
576
20
4
3
10
618
576
4
3
10
582
576
4
3
10
617
576
4
3
10
595
576
4
3
10
596
576
4
3
10
612
576
4
3
10
611
576
4
3
10
600
576
4
3
10
582
576
4
3
10
602
576
4
3
10
595
576
4
3
10
596
576
4
3
10
600
576
4
3
10
606
576
4
3
10
600
576
4
3
10
600
576
4
3
10
585
576
4
3
10
584
576
4
3
10
601
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
584
576
4
3
10
602
576
4
3
29
235
712
589
576
582
576
588
576
12
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
580
576
4
3
29
235
0
712
619
576
252
619
451
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
582
576
581
576
13
15
16
4
3
10
619
576
4
3
10
597
576
4
3
10
597
576
4
3
10
642
576
4
3
10
629
576
4
3
10
584
576
4
3
10
600
576
4
3
10
585
576
4
3
10
584
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
592
576
4
3
10
592
576
4
3
10
592
576
4
3
10
592
576
4
3
10
592
576
4
3
10
592
576
4
3
10
584
576
4
3
10
586
576
4
3
10
579
576
4
3
10
579
576
4
3
98
577
39
49
11
4
3
10
579
576
4
3
120
577
39
49
11
4
3
10
579
576
4
3
98
577
39
49
11
4
3
10
579
576
4
3
29
231
712
589
576
588
576
12
4
3
10
589
576
4
3
10
625
576
4
3
10
625
576
4
3
10
588
576
4
3
10
585
576
4
3
10
584
576
4
3
10
585
576
4
3
10
592
576
4
3
10
578
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
602
576
4
3
29
235
589
576
582
576
588
576
12
16
4
3
10
589
576
4
3
10
582
576
4
3
10
588
576
4
3
10
584
576
4
3
10
592
576
4
3
10
579
576
4
3
98
577
39
49
11
4
3
10
579
576
4
3
98
577
39
49
11
4
3
10
584
576
4
3
10
584
576
4
3
10
586
576
4
3
10
604
576
4
3
10
598
576
4
3
10
604
576
4
3
10
604
576
4
3
10
604
576
4
3
29
230
589
576
581
576
581
576
12
15
4
3
10
589
576
4
3
10
614
576
4
3
10
595
576
4
3
10
596
576
4
3
10
602
576
4
3
10
614
576
4
3
10
581
576
4
3
10
614
576
4
3
10
581
576
4
3
10
603
576
4
3
10
595
576
4
3
10
601
576
4
3
10
607
576
4
3
10
595
576
4
3
10
584
576
4
3
10
598
576
4
3
10
584
576
4
3
10
584
576
4
3
10
579
576
4
3
119
577
39
47
11
4
3
10
592
576
4
3
29
230
589
576
581
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
594
576
4
3
10
581
576
4
3
10
581
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
121
577
39
41
11
4
3
10
604
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
29
230
589
576
581
576
581
576
12
15
4
3
10
589
576
4
3
10
614
576
4
3
10
595
576
4
3
10
596
576
4
3
10
602
576
4
3
10
614
576
4
3
10
581
576
4
3
10
614
576
4
3
10
581
576
4
3
10
595
576
4
3
10
603
576
4
3
10
601
576
4
3
10
597
576
4
3
10
597
576
4
3
29
231
589
576
12
4
3
10
589
576
4
3
29
234
589
576
12
17
4
3
10
589
576
4
3
29
230
589
576
581
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
648
576
4
3
10
594
576
4
3
10
604
576
4
3
10
610
576
4
3
10
581
576
4
3
10
610
576
4
3
10
581
576
4
3
10
610
576
4
3
10
610
576
4
3
10
610
576
4
3
10
610
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
29
232
589
576
579
576
579
576
588
576
21
4
3
10
589
576
4
3
10
579
576
4
3
10
579
576
4
3
10
595
576
4
3
10
596
576
4
3
10
588
576
4
3
10
601
576
4
3
10
648
576
4
3
10
588
576
4
3
10
604
576
4
3
10
604
576
4
3
10
604
576
4
3
10
584
576
4
3
10
579
576
4
3
99
577
39
47
11
4
3
10
592
576
4
3
10
584
576
4
3
10
586
576
4
3
10
598
576
4
3
10
598
576
4
3
10
607
576
4
3
10
595
576
4
3
10
578
576
4
3
10
606
576
4
3
10
596
576
4
3
10
580
576
4
3
10
580
576
4
3
10
596
576
4
3
10
596
576
4
3
10
580
576
4
3
10
578
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
578
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
590
576
4
3
10
592
576
4
3
10
580
576
4
3
10
580
576
4
3
10
590
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
593
576
4
3
10
606
576
4
3
10
596
576
4
3
10
580
576
4
3
10
580
576
4
3
10
596
576
4
3
10
596
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
590
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
593
576
4
3
10
596
576
4
3
10
580
576
4
3
10
580
576
4
3
10
578
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
578
576
4
3
10
593
576
4
3
10
580
576
4
3
10
580
576
4
3
10
578
576
4
3
10
578
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
580
576
4
3
10
578
576
4
3
10
596
576
4
3
10
596
576
4
3
10
580
576
4
3
10
578
576
4
3
10
590
576
4
3
10
578
576
4
3
10
578
576
4
3
10
630
576
4
3
29
238
589
576
582
576
588
576
12
17
16
4
3
10
589
576
4
3
10
594
576
4
3
10
582
576
4
3
10
594
576
4
3
10
588
576
4
3
10
598
576
4
3
10
598
576
4
3
10
598
576
4
3
10
604
576
4
3
10
584
576
4
3
10
604
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
601
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
10
608
576
4
3
29
230
589
576
581
576
581
576
12
15
4
3
10
589
576
4
3
10
614
576
4
3
10
595
576
4
3
10
596
576
4
3
10
602
576
4
3
10
614
576
4
3
10
581
576
4
3
10
614
576
4
3
10
581
576
4
3
10
595
576
4
3
10
603
576
4
3
10
597
576
4
3
10
597
576
4
3
29
231
589
576
12
4
3
10
589
576
4
3
29
247
589
576
581
576
581
576
588
576
12
17
15
4
3
10
589
576
4
3
10
664
576
4
3
10
648
576
4
3
10
594
576
4
3
10
604
576
4
3
10
610
576
4
3
10
581
576
4
3
10
610
576
4
3
10
581
576
4
3
10
610
576
4
3
10
610
576
4
3
10
610
576
4
3
10
610
576
4
3
10
595
576
4
3
10
596
576
4
3
10
592
576
4
3
29
232
589
576
579
576
579
576
588
576
21
4
3
10
589
576
4
3
10
579
576
4
3
10
579
576
4
3
10
595
576
4
3
10
596
576
4
3
10
588
576
4
3
10
601
576
4
3
10
648
576
4
3
10
588
576
4
3
10
604
576
4
3
10
604
576
4
3
10
604
576
4
3
10
579
576
4
3
106
577
39
47
11
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
604
576
4
3
10
604
576
4
3
10
592
576
4
3
10
584
576
4
3
10
586
576
4
3
10
579
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
584
576
4
3
10
579
576
4
3
10
579
576
4
3
132
577
39
48
11
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
580
576
4
3
10
596
576
4
3
10
596
576
4
3
10
601
576
4
3
10
601
576
4
3
10
601
576
4
3
10
580
576
4
3
10
578
576
4
3
10
579
576
4
3
10
583
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
583
576
4
3
10
582
576
4
3
10
582
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
592
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
592
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
579
576
4
3
10
582
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
601
576
4
3
10
579
576
4
3
10
592
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
651
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
593
576
4
3
10
578
576
4
3
10
579
576
4
3
10
593
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
592
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
592
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
582
576
4
3
10
606
576
4
3
10
592
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
583
576
4
3
10
581
576
4
3
10
578
576
4
3
10
579
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
583
576
4
3
10
582
576
4
3
10
606
576
4
3
10
578
576
4
3
10
582
576
4
3
10
582
576
4
3
10
581
576
4
3
10
578
576
4
3
10
592
576
4
3
10
579
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
627
576
4
3
10
595
576
4
3
10
588
576
4
3
10
578
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
592
576
4
3
10
603
576
4
3
10
588
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
578
576
4
3
10
604
576
4
3
10
592
576
4
3
10
601
576
4
3
10
604
576
4
3
29
234
589
576
12
17
4
3
10
589
576
4
3
10
597
576
4
3
10
597
576
4
3
10
594
576
4
3
10
607
576
4
3
10
601
576
4
3
10
601
576
4
3
10
601
576
4
3
10
601
576
4
3
10
656
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
601
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
594
576
4
3
10
635
576
4
3
10
594
576
4
3
10
601
576
4
3
10
601
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
592
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
601
576
4
3
10
586
576
4
3
10
601
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
594
576
4
3
10
594
576
4
3
10
635
576
4
3
10
594
576
4
3
10
597
576
4
3
10
604
576
4
3
29
234
589
576
588
576
12
17
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
29
230
589
576
581
576
588
576
12
15
4
3
10
589
576
4
3
10
581
576
4
3
10
588
576
4
3
10
609
576
4
3
10
601
576
4
3
10
601
576
4
3
10
601
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
621
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
597
576
4
3
10
597
576
4
3
10
621
576
4
3
10
588
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
621
576
4
3
10
594
576
4
3
10
597
576
4
3
10
597
576
4
3
10
588
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
604
576
4
3
10
597
576
4
3
10
594
576
4
3
10
604
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
588
576
4
3
10
594
576
4
3
10
607
576
4
3
10
594
576
4
3
10
598
576
4
3
10
594
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
604
576
4
3
10
597
576
4
3
10
594
576
4
3
10
604
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
588
576
4
3
10
594
576
4
3
10
607
576
4
3
10
594
576
4
3
10
598
576
4
3
10
594
576
4
3
10
597
576
4
3
10
604
576
4
3
29
234
589
576
588
576
12
17
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
601
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
607
576
4
3
10
621
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
597
576
4
3
10
597
576
4
3
10
621
576
4
3
10
588
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
621
576
4
3
10
594
576
4
3
10
597
576
4
3
10
597
576
4
3
10
588
576
4
3
10
597
576
4
3
10
586
576
4
3
10
634
576
4
3
10
592
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
604
576
4
3
10
597
576
4
3
10
594
576
4
3
10
604
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
594
576
4
3
10
664
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
588
576
4
3
10
594
576
4
3
10
607
576
4
3
10
594
576
4
3
10
598
576
4
3
10
594
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
604
576
4
3
10
597
576
4
3
10
594
576
4
3
10
604
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
588
576
4
3
10
594
576
4
3
10
607
576
4
3
10
594
576
4
3
10
598
576
4
3
10
594
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
601
576
4
3
10
586
576
4
3
10
586
576
4
3
10
604
576
4
3
29
234
589
576
588
576
12
17
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
601
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
601
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
10
607
576
4
3
10
621
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
597
576
4
3
10
597
576
4
3
10
621
576
4
3
10
588
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
609
576
4
3
10
621
576
4
3
10
609
576
4
3
10
621
576
4
3
10
594
576
4
3
10
597
576
4
3
10
597
576
4
3
10
588
576
4
3
10
597
576
4
3
10
586
576
4
3
10
586
576
4
3
10
586
576
4
3
29
232
589
576
579
576
579
576
579
576
579
576
588
576
21
4
3
10
589
576
4
3
10
579
576
4
3
10
579
576
4
3
10
579
576
4
3
10
595
576
4
3
10
579
576
4
3
10
586
576
4
3
10
597
576
4
3
10
597
576
4
3
10
597
576
4
3
10
598
576
4
3
10
604
576
4
3
10
597
576
4
3
10
594
576
4
3
10
604
576
4
3
29
231
589
576
588
576
12
4
3
10
589
576
4
3
10
594
576
4
3
10
623
576
4
3
10
597
576
4
3
10
597
576
4
3
10
607
576
4
3
10
588
576
4
3
10
594
576
4
3
10
607
576
4
3
10
594
576
4
3
10
598
576
4
3
10
594
576
4
3
10
597
576
4
3
10
586
576
4
3
10
603
576
4
3
10
588
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
3
10
585
576
4
3
10
584
576
4
3
10
583
576
4
3
10
578
576
4
3
10
579
576
4
2
